==================
Simple function
==================

fn add(x: Int, y: Int) -> Int
  x

---

(source_file
  (function_declaration
    name: (identifier)
    (parameter_list
      (parameter
        pattern: (variable_pattern (identifier))
        type: (named_type (upper_identifier)))
      (parameter
        pattern: (variable_pattern (identifier))
        type: (named_type (upper_identifier))))
    (pure_return_type
      type: (named_type (upper_identifier)))
    (identifier)))

==================
Effect declaration
==================

effect IO
  fn stdout(msg: String) -[IO]> Unit

---

(source_file
  (effect_declaration
    name: (upper_identifier)
    (function_declaration
      name: (identifier)
      (parameter_list
        (parameter
          pattern: (variable_pattern (identifier))
          type: (named_type (upper_identifier))))
      (effect_return_type
        (effect_row
          (effect_ref
            name: (upper_identifier)))
        type: (named_type (upper_identifier))))))

==================
Type definition
==================

type Color = Red | Green | Blue

---

(source_file
  (type_definition
    name: (upper_identifier)
    (variant name: (upper_identifier))
    (variant name: (upper_identifier))
    (variant name: (upper_identifier))))

==================
Struct definition
==================

struct User
  name: String
  age: Int

---

(source_file
  (struct_definition
    name: (upper_identifier)
    (struct_field
      name: (identifier)
      type: (named_type (upper_identifier)))
    (struct_field
      name: (identifier)
      type: (named_type (upper_identifier)))))

==================
Trait definition
==================

trait Eq a
  fn eq(x: a, y: a) -> Bool

---

(source_file
  (trait_definition
    name: (upper_identifier)
    param: (identifier)
    (function_declaration
      name: (identifier)
      (parameter_list
        (parameter
          pattern: (variable_pattern (identifier))
          type: (named_type (identifier)))
        (parameter
          pattern: (variable_pattern (identifier))
          type: (named_type (identifier))))
      (pure_return_type
        type: (named_type (upper_identifier))))))

==================
Use declaration
==================

use IO
use Test

---

(source_file
  (use_declaration
    module: (upper_identifier))
  (use_declaration
    module: (upper_identifier)))

==================
Doc block on function
==================

doc Adds two integers together.
fn add(x: Int, y: Int) -> Int
  x

---

(source_file
  (documented_declaration
    (doc_block)
    (function_declaration
      name: (identifier)
      (parameter_list
        (parameter
          pattern: (variable_pattern (identifier))
          type: (named_type (upper_identifier)))
        (parameter
          pattern: (variable_pattern (identifier))
          type: (named_type (upper_identifier))))
      (pure_return_type
        type: (named_type (upper_identifier)))
      (identifier))))

==================
Multi-line doc block
==================

doc A user record.
doc Contains name and age fields.
struct User
  name: String
  age: Int

---

(source_file
  (documented_declaration
    (doc_block)
    (struct_definition
      name: (upper_identifier)
      (struct_field
        name: (identifier)
        type: (named_type (upper_identifier)))
      (struct_field
        name: (identifier)
        type: (named_type (upper_identifier))))))

==================
Doc block on effect
==================

doc Side-effectful I/O operations.
effect IO
  fn stdout(msg: String) -[IO]> Unit

---

(source_file
  (documented_declaration
    (doc_block)
    (effect_declaration
      name: (upper_identifier)
      (function_declaration
        name: (identifier)
        (parameter_list
          (parameter
            pattern: (variable_pattern (identifier))
            type: (named_type (upper_identifier))))
        (effect_return_type
          (effect_row
            (effect_ref
              name: (upper_identifier)))
          type: (named_type (upper_identifier)))))))

==================
Test declaration
==================

test "simple test"
  true

---

(source_file
  (test_declaration
    name: (string)
    (boolean)))
